Repository: EvaSeidlmayer/FSoLS
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: Welcome
de: Willkommen

source: Please submit text for Wikifier Annotation
de: Bitte geben Sie einen Text für den Wikifier Annotator ein.

source: Please submit text for text style classification
de: Bitte geben Sie einen Text für den Text-Stil-Klassifikator ein.

source: NLP strategies to handle disinformation
de: NLP Strategien für den Umgang mit Desinformationen

source: Change Language
de: Sprache ändern

source: The growing prevalence of misinformation and disinformation poses a serious threat to our democratic society. Often spread by political lobby groups or corporations to manipulate public discourse, it can be difficult for individuals to determine whether the information they encounter is true or false. Disinformation also occurs in scientific contexts, where it can directly impact the work of researchers. Explore different methods for analyzing a potentially misleading text passage.
de: Die Zunahme von Falsch- und Desinformationen stellt ein gravierendes Problem für unsere demokratische Gesellschaft dar. Verbreitet werden sie von politischen Lobbygruppen oder Unternehmen, um den öffentlichen Diskurs zu beeinflussen. Für Nutzer:innen kann er schwierig sein, zu bewerten, ob eine Information falsch oder richtig ist oder zu manipulativen Zwecken verbreitet wurde.Auch in wissenschaftlichen Kontexten finden sich desinformierenden Inhalte, die auch die wissenschaftliche Erkenntnisfindung Einfluß nehmen können.Hier können Sie unterschiedliche Sprachmodelle basierend auf Methoden des Maschinellen Lernens ausprobieren und verschiedene Inhalte und Sprachstile überprüfen.

source: Disinformation is defined by two key factors:
de: Disinformationen zeichnen sich einerseits durch

source: The inaccuracy of the information
de: 1. Falschheit der Information aus

source: and
de: und durch die

source: The intention to mislead
de: Intention, falsche Informationen zu verbreiten.

source: Four Shades of Life Sciences Intention Classifier
de: Four Shades of Life Sciences Textstil-Klassifikator

source: The central hypothesis of Project AQUAS is that the motives behind disinformation—such as gaining attention, financial profit, or political influence—shape both the syntax and semantics of the texts used to spread it.
de: Die Hypothese des hier vorgestellten Tools lautet, dass die verschiedenen Motivationen Desinformationen zu verbreiten(Aufmerksamkeit, Geld, Einfluss für politische Positionen) die Syntax und Semantik eines Textes prägen.Modelle des Maschinellen Lernens könenn diese Sprachstile erlernen. Um enstprechende Modelle zu trainieren, wurde ein Datensatz aus vier Textarten zusammengestellt, den vier Schattierungen der Lebenswissenschaften (Four Shades of Life Sciences):

source: By applying machine learning techniques, a language model can be trained to recognize the distinctive features of such texts, including specific terminology and stylistic patterns. To enable this, we have compiled a dataset of life science documents categorized into four groups, referred to as the "four shades of life sciences":
de: Modelle des Maschinellen Lernens könenn diese Sprachstile erlernen. Um enstprechende Modelle zu trainieren, wurde ein Datensatz aus vier Textarten zusammengestellt, den vier Schattierungen der Lebenswissenschaften (Four Shades of Life Sciences):

source: Scientific text style
de: Wissenschaftlicher Textstil

source: Vernacular text style
de: Populärwissenschaftlicher Textstil

source: Disinformative text style
de: Desinformativer Textstil

source: Alternative scientific text style
de: Alternativwissenschaftlicher Textstil

source: Based on this dataset, several models have been fine-tuned to classify similar language styles.
de: Basierend auf den zusammengestellten Daten wurden mehrere Modelle trainiert, um Ähnlichkeiten im Sprachstil zu erkennen.

source: You can choose between traditional <a href="https://en.wikipedia.org/wiki/Bag-of-words_model">Bag of Words</a> methods—such as <a href="https://en.wikipedia.org/wiki/Random_forest">Random Forest</a>, <a href="https://en.wikipedia.org/wiki/Support_vector_machine">Support Vector Machine</a>, and <a href="https://en.wikipedia.org/wiki/Logistic_regression">Logistic Regression</a> —or advanced <a href="https://en.wikipedia.org/wiki/Transformer_(deep_learning_architecture)">transformer</a>-based language models, including BERT, and SPECTER.
de: Sie können zwischen den folgenden einfachen Modellen wählen <a href="https://en.wikipedia.org/wiki/Bag-of-words_model">Bag of Words</a>, <a href="https://en.wikipedia.org/wiki/Random_forest">Random Forest</a>, <a href="https://en.wikipedia.org/wiki/Support_vector_machine">Support Vector Machine</a>, <a href="https://en.wikipedia.org/wiki/Logistic_regression">Logistic Regression</a>, und Large Language Modellen aus der <a href="https://en.wikipedia.org/wiki/Transformer_(deep_learning_architecture)">Transformer</a>-Familie, wie Bert, und Specter.

source: Currently, automatically validating facts in full texts remains a challenging task.
de: Derzeit ist es nicht leicht, Aussagen aus Volltexten automatisiert auf ihren Wahrheitsgehalt hin zu verifizieren (Faktencheck).

source: However,
de: Named entity recognition

source: (NER) can be used to identify key terms, which can then be linked to external knowledge bases.
de: Argumentationen in langen Texten sind oft komplex und problematische Aussagen ergeben sich oft erst aus dem Kontext, in dem sie getroffen werden.

source: By using the entity linking service Wikifier, we can retrieve corresponding records from Wikidata and Wikipedia to help verify the information presented.
de: Bei einem automatisierten Faktencheck werden in der Regel, einzelne Aussagen aus eiem Text herausgelöst und gegen einen Referenzkorpus verglichen, der zum Goldstandard für Wahrheit erklärt wird.

source: Try annotating the questionable text using
de: Lassen Sie einen fragwürdigen Text mit dem Wikifier Annotator mit den entsprechenden Einträgen aus Wikipedia und Wikidata annotieren.

source: to retrieve relevant knowledge base entries.
de: Auf diese Weise können Sie selbst viele der Aussagen überpüfen und in ihren Kontext stellen.

source: For more information, note that Wikifier was developed by Janez Brank, who implemented it as a tool for linking text entities to Wikipedia andWikidata.
de: Wikifier wurde von Janez Brank entwickelt.

source: Use Wikifier to retrieve additional information from Wikipedia and Wikidata.
de: Mit Wikifier lassen sich zuätzliche Informationen von Wikipedia und Wikidata abrufen.

source: Please note that the annotated text is truncated after 1,000 characters.
de: Nach 1000 Zeichen wird der eingegebene Text abgeschnitten.

source: Submit
de: Abschicken!

source: Clear
de: Löschen!

source: Response:
de: Antwort:

source: The model predicted class...
de: Das Model ordnet den Text den folgenden Klassen zu...

source: On the project AQUAS
de: Über das Projekt AQUAS:

source: The project "Automatic Quality Assessment: NLP methods for semantic mapping of life-science texts" (AQUAS) is funded by German Research Foundation. The project runs from November 2022 till November 2025. Please notice the project website:
de: Das Projekt 'Automatic Quality Assessment: NLP-Verfahren zur semantischen Kartierung von lebenswissenschaftlichen Texten' (AQUAS) wird von der DFG gefördert. Die Projektlaufzeit ist von November 2022 bis November 2025. Besuchen Sie die Projektseite bei ZB MED:
